'use strict';

// First task

alert('Привіт, шкіряний мішок! Виходимо на складний рівень!');

let radius = prompt('Якби твій пакет АТБ був круглим, який би він мав радіус в см?');

const pi = 3.14;
let circle_area = radius * radius * pi;

alert(`Він мав би площу ${circle_area} см2. Достатньо, аби набрати пива по акції`);

// Second task

let distance = prompt('Якщо б ти програв у лотерею і тобі треба було навідати тещу. На скільки це далеко, в км?');
let time = prompt('Як довго, в годинах, зайняв би шлях? *У Моісея було на це 40 років або 350640 годин');

let moving_speed = distance / time;

alert(`Якщо не хочеш бути покараним і їсти кислі борщі, треба буде бігти не повільніше за ${moving_speed} км/год`);

// Third task

let dollars = prompt('Вітаю! Жінка забрала всі гроші. На останню заначку ти вирішив втікти в Польщу. Скільки доларів міняємо в євро?');
const exchange_rate = 0.8;
const wrong_exchange_rate = prompt('По якому курсу доллара до євро хочеш поміняти?');
let euros = dollars * exchange_rate;
alert(`Спіткала невдача! В кожного бариги свій курс, як для своїх (Ха-ха!) він був ${exchange_rate}. На виході отримав всього ${euros} євро! Моя бабця на помідорах в сезон більше має! Шукай роботу!`);