//MIN 

//Ім'я та прізвища (два слова розділені пробілом, тільки букви)
const personalInfo = (/^[A-ZА-ЯІЇ\'\][a-zа-яії]{1,}\s[A-ZА-ЯІЇ\'\][a-zа-яії]{1,}$/g);
console.log(personalInfo.test("Ян Македонський")); 
/*Ян Македонський Ярослав Мудрий Мар'ян Іванов Владимир Зеленский Jane Hopster*/


//Дати (формат 02.10.2021)
const date = /^(0[1-9]|[1-2][0-9]|3[0-1])[- . .](0[1-9]|1[0-2])[- . .]([0-2][0-9][0-9][0-9])$/g 
console.log(date.test("25.03.2021")); 


//Логіна (тільки літери і цифри, всі букви тільки в нижньому регістрі)
const login = (/^(([a-zа-я]?){1,}([0-9]))\d*$/g)
console.log(login.test("Supermakaka1212"))   //proultrasuperman221, супермен228 


//NORM

//Пароля (символів має бути не менше 8, повинна бути мінімум одна цифра, і одна велика літера)
const passwordValidation = (/(?=.*[a-z])(?=.*[A-Z])[a-zA-Z\d]{8,}/g)
console.log(passwordValidation.test("Supermakaka1212"))

